<a href="https://colab.research.google.com/github/GENNYB7/TitanicData/blob/main/TitanicData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd
filename = '/content/drive/MyDrive/Coding_Dojo/PandasForDataManipulation/titanic.csv'
titanic_df = pd.read_csv(filename)
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [3]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
titanic_df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [6]:
died_number = 549
survived_number = 342
avg = (died_number + survived_number) / 2
print(avg)

445.5

In [7]:
titanic_df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [21]:
male_number = 577
female_number = 314
male_filter = titanic_df['Sex']== 'male'
male_filter.head()

0     True
1    False
2    False
3    False
4     True
Name: Sex, dtype: bool

In [22]:
female_filter = titanic_df['Sex']== 'female'
female_filter.head()

0    False
1     True
2     True
3     True
4    False
Name: Sex, dtype: bool

In [23]:
survived_filter = titanic_df['Survived']!= 0
survived_filter.head()

0    False
1     True
2     True
3     True
4    False
Name: Survived, dtype: bool

In [24]:
titanic_df[male_filter & survived_filter].head( )

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
17           18         1       2  ...  13.0000   NaN         S
21           22         1       2  ...  13.0000   D56         S
23           24         1       1  ...  35.5000    A6         S
36           37         1       3  ...   7.2292   NaN         C
55           56         1       1  ...  35.5000   C52         S

[5 rows x 12 columns]

In [30]:
titanic_df[male_filter & survived_filter].value_counts()

PassengerId  Survived  Pclass  Name                                          Sex   Age    SibSp  Parch  Ticket             Fare      Cabin        Embarked
890          1         1       Behr, Mr. Karl Howell                         male  26.00  0      0      111369             30.0000   C148         C           1
513          1         1       McGough, Mr. James Robert                     male  36.00  0      0      PC 17473           26.2875   E25          S           1
461          1         1       Anderson, Mr. Harry                           male  48.00  0      0      19952              26.5500   E12          S           1
454          1         1       Goldenberg, Mr. Samuel L                      male  49.00  1      0      17453              89.1042   C92          C           1
450          1         1       Peuchen, Major. Arthur Godfrey                male  52.00  0      0      113786             30.5000   C104         S           1
446          1         1       Dodge, Master. Washington                     male  4.00   0      2      33638              81.8583   A34          S           1
431          1         1       Bjornstrom-Steffansson, Mr. Mauritz Hakan     male  28.00  0      0      110564             26.5500   C52          S           1
430          1         3       Pickard, Mr. Berk (Berk Trembisky)            male  32.00  0      0      SOTON/O.Q. 392078  8.0500    E10          S           1
391          1         1       Carter, Mr. William Ernest                    male  36.00  1      2      113760             120.0000  B96 B98      S           1
371          1         1       Harder, Mr. George Achilles                   male  25.00  1      0      11765              55.4417   E50          C           1
341          1         2       Navratil, Master. Edmond Roger                male  2.00   1      1      230080             26.0000   F2           S           1
306          1         1       Allison, Master. Hudson Trevor                male  0.92   1      2      113781             151.5500  C22 C26      S           1
249          1         1       Beckwith, Mr. Richard Leonard                 male  37.00  1      1      11751              52.5542   D35          S           1
225          1         1       Hoyt, Mr. Frederick Maxfield                  male  38.00  1      0      19943              90.0000   C93          S           1
210          1         1       Blank, Mr. Henry                              male  40.00  0      0      112277             31.0000   A31          C           1
194          1         2       Navratil, Master. Michel M                    male  3.00   1      1      230080             26.0000   F2           S           1
184          1         2       Becker, Master. Richard F                     male  1.00   2      1      230136             39.0000   F4           S           1
98           1         1       Greenfield, Mr. William Bertram               male  23.00  0      1      PC 17759           63.3583   D10 D12      C           1
24           1         1       Sloper, Mr. William Thompson                  male  28.00  0      0      113788             35.5000   A6           S           1
485          1         1       Bishop, Mr. Dickinson H                       male  25.00  1      0      11967              91.0792   B49          C           1
551          1         1       Thayer, Mr. John Borland Jr                   male  17.00  0      2      17421              110.8833  C70          C           1
858          1         1       Daly, Mr. Peter Denis                         male  51.00  0      0      113055             26.5500   E17          S           1
573          1         1       Flynn, Mr. John Irwin ("Irving")              male  36.00  0      0      PC 17474           26.3875   E25          S           1
803          1         1       Carter, Master. William Thornton II           male  11.00  1      2      113760             120.0000  B96 B98      S           1
752          1         3       Moor, Master. Meier                           male  6.00   0      1      392096             12.4750   E121         S           1
738          1         1       Lesurer, Mr. Gustave J                        male  35.00  0      0      PC 17755           512.3292  B101         C           1
725          1         1       Chambers, Mr. Norman Campbell                 male  27.00  1      0      113806             53.1000   E8           S           1
713          1         1       Taylor, Mr. Elmer Zebley                      male  48.00  1      0      19996              52.0000   C126         S           1
708          1         1       Calderhead, Mr. Edward Pennington             male  42.00  0      0      PC 17476           26.2875   E24          S           1
702          1         1       Silverthorne, Mr. Spencer Victor              male  35.00  0      0      PC 17475           26.2875   E24          S           1
691          1         1       Dick, Mr. Albert Adrian                       male  31.00  1      0      17474              57.0000   B20          S           1
682          1         1       Hassab, Mr. Hammad                            male  27.00  0      0      PC 17572           76.7292   D49          C           1
680          1         1       Cardeza, Mr. Thomas Drake Martinez            male  36.00  0      1      PC 17755           512.3292  B51 B53 B55  C           1
648          1         1       Simonius-Blumer, Col. Oberst Alfons           male  56.00  0      0      13213              35.5000   A26          C           1
646          1         1       Harper, Mr. Henry Sleeper                     male  48.00  1      0      PC 17572           76.7292   D33          C           1
633          1         1       Stahelin-Maeglin, Dr. Max                     male  32.00  0      0      13214              30.5000   B50          C           1
631          1         1       Barkworth, Mr. Algernon Henry Wilson          male  80.00  0      0      27042              30.0000   A23          S           1
622          1         1       Kimball, Mr. Edwin Nelson Jr                  male  42.00  1      0      11753              52.5542   D19          S           1
600          1         1       Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")  male  49.00  1      0      PC 17485           56.9292   A20          C           1
588          1         1       Frolicher-Stehli, Mr. Maxmillian              male  60.00  1      1      13567              79.2000   B41          C           1
22           1         2       Beesley, Mr. Lawrence                         male  34.00  0      0      248698             13.0000   D56          S           1
dtype: int64

In [28]:
titanic_df[female_filter & survived_filter].value_counts()

PassengerId  Survived  Pclass  Name                                                 Sex     Age   SibSp  Parch  Ticket    Fare      Cabin            Embarked
888          1         1       Graham, Miss. Margaret Edith                         female  19.0  0      0      112053    30.0000   B42              S           1
300          1         1       Baxter, Mrs. James (Helene DeLaudeniere Chaput)      female  50.0  0      1      PC 17558  247.5208  B58 B60          C           1
310          1         1       Francatelli, Miss. Laura Mabel                       female  30.0  0      0      PC 17485  56.9292   E36              C           1
311          1         1       Hays, Miss. Margaret Bechstein                       female  24.0  0      0      11767     83.1583   C54              C           1
312          1         1       Ryerson, Miss. Emily Borie                           female  18.0  2      2      PC 17608  262.3750  B57 B59 B63 B66  C           1
                                                                                                                                                                ..
592          1         1       Stephenson, Mrs. Walter Bertram (Martha Eustis)      female  52.0  1      0      36947     78.2667   D20              C           1
610          1         1       Shutes, Miss. Elizabeth W                            female  40.0  0      0      PC 17582  153.4625  C125             S           1
619          1         2       Becker, Miss. Marion Louise                          female  4.0   2      1      230136    39.0000   F4               S           1
628          1         1       Longley, Miss. Gretchen Fiske                        female  21.0  0      0      13502     77.9583   D9               S           1
2            1         1       Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0  1      0      PC 17599  71.2833   C85              C           1
Length: 82, dtype: int64